In [1]:
# import modules
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.1.3
1.19.2

In [2]:
# persiapan data frame
n_rows = 5
n_cols = 2
cols = ('omset', 'operasional')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)),
                  columns = cols)
df

   omset  operasional
0     12           17
1      8            9
2      4           16
3      8            5
4      7            2

In [3]:
df['omset'] = df['omset']*100_000
df['operasional'] = df['operasional']*10_000
df

     omset  operasional
0  1200000       170000
1   800000        90000
2   400000       160000
3   800000        50000
4   700000        20000

In [4]:
df.index = pd.util.testing.makeDateIndex(n_rows, freq='D')
df = df.reset_index()
df = df.rename(columns={'index' : 'tanggal'})
df

C:\Users\ASUS\anaconda3\lib\site-packages\pandas\util\__init__.py:12: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

     tanggal    omset  operasional
0 2000-01-01  1200000       170000
1 2000-01-02   800000        90000
2 2000-01-03   400000       160000
3 2000-01-04   800000        50000
4 2000-01-05   700000        20000

In [5]:
# melakukan formatting tampilan data frame
formatku = {'tanggal':'{:%d/%m/%y}',
            'operasional':'Rp {:.2f}',
            'omset':'Rp {:.2f}'}

laporan = df.style.format(formatku)
laporan

In [6]:
type(laporan)

pandas.io.formats.style.Styler

In [7]:
laporan.hide_index()

In [8]:
laporan.set_caption('Data Omset dan Operasional')

In [9]:
laporan.highlight_min('omset', color='pink')
laporan.highlight_max('omset', color='lightgreen')

laporan.highlight_min('operasional', color='lightblue')
laporan.highlight_max('operasional', color='grey')